{"pageProps":{"frontmatter":{"layout":"blog-post","title":"Announcing Ballerina 2201.2.0 (Swan Lake Update 2)","author":"Ballerina Team","published-date":"10 September 2022","status":"Published","socialmediaimage":"Ballerina-Swan-Lake-GA-Release-banner-02-with-button.png","permalink":"/posts/2022-08-10-announcing-ballerina-2201.2.0-swan-lake-update-2/"},"content":"\n<style>.cBlogContent p{white-space: break-spaces !important;}</style>\n\nWe are happy to announce a new release, [Ballerina 2201.2.0 (Swan Lake Update 2)](https://ballerina.io/downloads/), the second update release of Ballerina Swan Lake.\n\n## Additions to the language\n\n- The language now comes with support for resource methods in client objects. These resource methods can only be accessed by client resource access actions. With this feature, resource methods are also allowed in object-type descriptors.\n- You can also create maps with query expressions; a query expression that constructs a map must start with the map keyword. The type of the select expression must be a tuple `[string, T]`. Then, the query expression will create a value of type `map<T>`. Duplicate keys will be handled similarly to a query expression constructing a table.\n- Now, Ballerina comes with support for running new strands safely on separate threads. The isolated feature has been extended to identify cases where strands created by a start action or a named worker can be run safely on separate threads. The strand created by a named worker can run on a separate thread from the default worker if the body of the worker satisfies the requirements for an isolated function.\n\n## Improvements to the language\n\n- The contextually-expected type for interpolations in XML template expressions has been changed to `xml`. This ensures that a query expression as an interpolation works as expected. However, it is not an error for the static type to not be a subtype of the contextually-expected type.\n- Query expressions are now allowed with `readonly` contextually-expected types. Such query expressions create immutable structural values.\n- Previously, a variable needed to be declared in the on-fail clause (e.g., `on fail error err`). It has now been made optional.\n- The grammar now allows an action such as a remote method call to occur inside a query.\n- The `lang.function:call()` langlib function has been introduced to call a function dynamically passing a function value and optional argument(s). If the arguments do not match the parameters expected by the function, the function call results in a panic.\n\nMore precise explanations are provided in the [release note](https://ballerina.io/downloads/swan-lake-release-notes/swan-lake-2201.2.0).\n\nThis update release comes with multiple new features and improvements in the runtime.\n\n- You can now get the status of strands and strand groups during the execution of a Ballerina program, which can be used to troubleshoot runtime errors. The Ballerina runtime will emit the strand dump to the standard output stream in the text format if it receives a `SIGTRAP` signal (`SIGTRAP` is not available on Windows).\n- You can also register a function that will be called during a graceful shutdown. A call to `onGracefulStop` will result in one call to the handler function that was passed as an argument; the handler functions will be called after calling `gracefulStop` on all registered listeners in the reverse order of the corresponding calls to `onGracefulStop` (e.g., the function foo can be called during the graceful shutdown by registering it as follows: `runtime:onGracefulStop(foo);`).\n- In terms of improvements, when a type is defined referring to another type, it will now be passed to the runtime as a `BTypeReferenceType` instance. A few existing runtime APIs have been modified to return the `BTypeReferenceType` instances.\n\n## Improvements to the standard library\n\nThe following standard library and extended library modules now come with new features and improvements: \n\n### `io`\n\n- Added support for data mapping between Ballerina Records and CSV in CSV read/write APIs\n\n### `constraint`\n\n- Introduced the `constraint` standard library package, which provides features to validate the values that have been assigned to Ballerina types\n\n### `http`\n\n- Added the initial support for HATEOAS\n- Added support for client resource methods in the HTTP client\n- Added proxy support for the HTTP2 client\n- Added constraint validation to HTTP payload binding\n- Made HTTP2 the default transport for the `http` module\n- Updated the default response status as `HTTP 201` for POST resources\n- Implemented the `immediateStop()` function for the HTTP listener\n\n### `websocket`\n\n- Added constraint validation to WebSocket payload binding\n\n### `graphql`\n\n- Added the support for deprecation of fields and enum values\n- Added the support for GraphQL interceptors\n\n### `serdes`\n\n- Introduced the `serdes` standard library module for serializing and deserializing Ballerina `anydata` subtypes\n- Proto3 is the initial serialization/deserialization format supported by this module\n\n### `os`\n\n- Introduced the `exec()` function to support OS command execution in Ballerina\n\n### `xmldata`\n\n- Introduced new APIs such as `fromXml` and `toXml` to perform conversions between XML and `map<anydata>`. The `toRecord` API is being deprecated by introducing this `fromXml` API\n- Introduced a new config named `rootTag` in the `JsonOptions` to configure the name of the XML root element tag\n\n### `random`\n\n- Updated the `createDecimal()` function to be cryptographically secure\n\n### `sql`\n\n- Added schema client abstraction to support metadata retrieval from SQL databases. The implementation for the connectors will be added soon\n\n### `grpc`\n\n- Introduced a message-level annotation for the proto descriptor instead of a centralized proto descriptor\n- Introduced a new service-level annotation (`grpc:Descriptor`) as a replacement for the existing (`grpc:ServiceDescriptor`) annotation. Both annotations are supported now to maintain backward compatibility. The `grpc:ServiceDescriptor` will be removed in the future. (Please update the service annotation if stub files are regenerated for the existing gRPC services)\n\n### `kafka`\n\n- Added constraint validation support for payload binding\n\n### `rabbitmq` \n\n- Added constraint validation support for payload binding\n\n### `nats`\n\n- Added constraint validation support for payload binding\n\n## Improvements to the developer tools\n\nHere are the major new features and improvements you can find in the developer tools:  \n\n- The `bal graph` CLI command, which resolves the dependencies of the current package and prints the dependency graph in the console has been introduced. This produces the textual representation of the dependency graph using the DOT graph description language.\n- The experimental `bal semver` CLI command has been introduced to validate the [Semantic Versioning](https://semver.org/) compatibility of the local package changes against any previously published version(s) in Ballerina Central. The tool is currently capable of listing source code differences (along with its compatibility impact) between the local and any published version and suggesting the new package version based on the compatibility impact of the source code changes.\n- The language server now supports API docs reference support on hover. Code actions also went through many improvements and transformations: code actions to extract anonymous records into records and to generate undefined record types, source actions to generate getters and setters for class-level variables, a new code action to make annotation declarations with the `source` attach point(s) constant, etc.  \n- The OpenAPI Tool comes with added support for generating client resource methods in the client generation command. There is also added support for OpenAPI schema constraint properties in client/service generation. With this improvement, the OpenAPI constraints will be applied as `ballerina/constraint` standard library package annotations when generating Ballerina clients and services from the OpenAPI definition. \n- The JSON value to Ballerina record conversion logic has been improved to enhance the conversion experience of the `Paste JSON as record` feature in the Ballerina VSCode extension.\n\nWith respect to Code to Cloud features, a notable change is that the base image was updated to `ballerina/jvm-runtime:1.0` based on Alpine 3.15 with the necessary libraries.\n\nWe made numerous other changes in this release including many bug fixes to the compiler, runtime, standard library, and developer tools. See the [release note](https://ballerina.io/downloads/swan-lake-release-notes/swan-lake-2201.2.0) for all the details of this release. \n\nWe want to extend our sincerest thanks to the Ballerina community for your valuable feedback and support in making Ballerina what it is today. We hope you enjoy this release.\n\nHappy coding! \n\nCheers, \nThe Ballerina Team","codes":"[]","slug":"2022-08-10-announcing-ballerina-2201.2.0-swan-lake-update-2"},"__N_SSG":true}